* TODOS for dancemanager
** DONE ファイル読み込みを楽にする
   CLOSED: [2017-11-12 日 21:33]
   :LOGBOOK:
   CLOCK: [2017-11-12 日 20:34]--[2017-11-12 日 21:33] =>  0:59
   CLOCK: [2017-11-12 日 18:07]--[2017-11-12 日 18:32] =>  0:25
   CLOCK: [2017-11-12 日 16:29]--[2017-11-12 日 16:54] =>  0:25
   CLOCK: [2017-11-12 日 15:29]--[2017-11-12 日 15:54] =>  0:25
   CLOCK: [2017-11-12 日 14:46]--[2017-11-12 日 15:11] =>  0:25
   CLOCK: [2017-11-12 日 07:17]--[2017-11-12 日 07:42] =>  0:25
   CLOCK: [2017-11-12 日 06:38]--[2017-11-12 日 07:03] =>  0:25
   :END:
   <2017-11-12 日>
   - ジャッジファイルなくす
     - games[1].options.rounds[1].judgeをジャッジグループ番号からジャッジ数に変える
     - tempGame内のjudgesもjudgeNumに変える
     
   - 読み込みボタンを一つにする

** DONE 順番廃止
   CLOSED: [2017-11-14 火 14:51]
  <2017-11-12 日> 
** TODO ファイル管理を見やすく
  <2017-11-12 日> 
   - dataファイル以下にラウンドデータとかを入れるようにする。
   - 要するにプロジェクトファイルをきれいにする
** TODO [#C] もうちょいコードをわかりやすく
  <2017-11-12 日> 
   - 同じ処理はもうちょいまとめていく
** TODO uiStatesのtempをできる限り消したい
  <2017-11-12 日> 
** TODO judgeIdって連番であること保証されてる？
  <2017-11-12 日> 
  [[file:app/components/MainPanel/ScoreTableJudge.jsx::}%20else%20if%20(Object.keys(judgeGroup)%5Bthis.state.selectedJudge0idx%20+%201%5D)%20{][refrence]] 
** DONE [#A] 選手情報編集でよく落ちる
   CLOSED: [2017-11-15 水 21:42]
  <2017-11-12 日> 
** TODO [#A] ファイルを開くコマンドが壊れてる 
   <2017-11-12 日>
** DONE ジャッペのデザイン変える
   CLOSED: [2017-11-14 火 13:20]
   - バインダーがかぶるらしい
  <2017-11-12 日> 
** DONE 印刷物のテンプレではみ出した際にoverflow: hiddenにする
   CLOSED: [2017-11-12 日 21:35]
  <2017-11-12 日> 
** TODO [#A] Competitor追加の際、現在の人数依存でIDを決めないようにする
  <2017-11-15 水> 
** TODO 選手削除も一応できるようにしてもいいかも
  <2017-11-15 水> 
** TODO [#A] 選手のソート終わってなかった気がする
  <2017-11-15 水> 
** TODO 予選への選手の途中追加
  <2017-11-15 水> 
** DONE チェック画面のヘッダーのデザインをflexで自分で実装する
   CLOSED: [2017-11-17 金 12:59]
** DONE [#A] FileImporter壊れてる
   CLOSED: [2017-11-17 金 12:59]

** DONE [#A] データ読み込みしたらroundとscoreファイルバックアップして消す
   CLOSED: [2018-06-03 日 18:20]
** TODO DataPanel から ChangeHeatsButton へのpropsの受け渡しをきれいに
** TODO ジャッペの番号指定を復活させる

** DONE チェック表の確認をできるように
   CLOSED: [2018-06-03 日 19:03]
** DONE シード未記入でも試合を生成できるように
   CLOSED: [2018-06-03 日 19:14]
** TODO 予選からいきなり決勝に行ってないかチェック


* Info
** ビルドの手順
  package-production.jsonとwebpack-production.config.jsをもとのpackage.jsonやらと名前を交換する。
  そしたらnpm run buildからの
  electron-packager . Dancemanager --platform=win32 --arch=ia32 or x64
